; domain
(define (domain gripper-strips)

    (:predicates (room ?r)
                (ball ?b)
                (gripper ?g)
                (at-robby ?r)
                (at ?b ?r)
                (free ?g)
                (carry ?o ?g)
    )

    (:action move
        :parameters (?from ?to)
        :precondition (and (room ?from)(room ?to)(at-robby ?from))
        :effect (and
            (at-robby ?to)
            (not (at-robby ?from))
        )
    )
    (:action pick
        :parameters (?obj ?room ?gripper)
        :precondition (and (ball ?obj)(room ?room)(gripper ?gripper)(at ?obj ?room)(at-robby ?room)(free ?gripper))
        :effect (and
            (carry ?obj ?gripper)
            (not (at ?obj ?room))
            (not (free ?gripper))
        )
    )
    (:action drop
        :parameters (?obj ?room ?gripper)
        :precondition (and (ball ?obj)(room ?room)(gripper ?gripper)(carry ?obj ?gripper)(at-robby ?room))
        :effect (and
            (at ?obj ?room)
            (free ?gripper)
            (not (carry ?obj ?gripper))
        )
    )
)

; problem
(define (problem gripper-37)
(:domain gripper-strips)
(:objects rooma roomb room3 room4 room5 left right ball1 ball2 ball3 ball4 ball5 ball6 ball7 ball8 ball9 ball10 ball11 ball12 ball13 ball14 ball15 ball16 ball17 ball18 ball19 ball20 ball21 ball22 ball23 ball24 ball25 ball26 ball27 ball28 ball29 ball30 ball31 ball32 ball33 ball34 ball35 ball36 ball37 )
(:init
(room rooma)
(room roomb)
(room room3)
(room room4)
(room room5)
(gripper left)
(gripper right)
(ball ball1)
(ball ball2)
(ball ball3)
(ball ball4)
(ball ball5)
(ball ball6)
(ball ball7)
(ball ball8)
(ball ball9)
(ball ball10)
(ball ball11)
(ball ball12)
(ball ball13)
(ball ball14)
(ball ball15)
(ball ball16)
(ball ball17)
(ball ball18)
(ball ball19)
(ball ball20)
(ball ball21)
(ball ball22)
(ball ball23)
(ball ball24)
(ball ball25)
(ball ball26)
(ball ball27)
(ball ball28)
(ball ball29)
(ball ball30)
(ball ball31)
(ball ball32)
(ball ball33)
(ball ball34)
(ball ball35)
(ball ball36)
(ball ball37)
(free left)
(free right)
(at ball1 rooma)
(at ball2 rooma)
(at ball3 rooma)
(at ball4 rooma)
(at ball5 rooma)
(at ball6 rooma)
(at ball7 rooma)
(at ball8 rooma)
(at ball9 rooma)
(at ball10 roomb)
(at ball11 roomb)
(at ball12 roomb)
(at ball13 roomb)
(at ball14 roomb)
(at ball15 roomb)
(at ball16 roomb)
(at ball17 roomb)
(at ball18 roomb)
(at ball19 roomb)
(at ball20 roomb)
(at ball21 room3)
(at ball22 room3)
(at ball23 room3)
(at ball24 room3)
(at ball25 room3)
(at ball26 room3)
(at ball27 room3)
(at ball28 room3)
(at ball29 room4)
(at ball30 room4)
(at ball31 room4)
(at ball32 room5)
(at ball33 room5)
(at ball34 room5)
(at ball35 room5)
(at ball36 room5)
(at ball37 room5)
(at-robby rooma)
)
(:goal
(and
(at ball1 room3)
(at ball2 room3)
(at ball3 room3)
(at ball4 room3)
(at ball5 room3)
(at ball6 room3)
(at ball7 room3)
(at ball8 room3)
(at ball9 room3)
(at ball10 room3)
(at ball11 room3)
(at ball12 room3)
(at ball13 room3)
(at ball14 room3)
(at ball15 room3)
(at ball16 room3)
(at ball17 room3)
(at ball18 room3)
(at ball19 room3)
(at ball20 room3)
(at ball21 room3)
(at ball22 room3)
(at ball23 room3)
(at ball24 room3)
(at ball25 room3)
(at ball26 room3)
(at ball27 room3)
(at ball28 room3)
(at ball29 room3)
(at ball30 room3)
(at ball31 room3)
(at ball32 room3)
(at ball33 room3)
(at ball34 room3)
(at ball35 room3)
(at ball36 room3)
(at ball37 room3)
)
)
)

; plan
1. (pick ball9 rooma left)
   deleted: (at ball9 rooma) (free left)
   added: (carry ball9 left)
   goals met: 8 of 37
2. (pick ball8 rooma right)
   deleted: (at ball8 rooma) (free right)
   added: (carry ball8 right)
   goals met: 8 of 37
3. (move rooma room3)
   deleted: (at-robby rooma)
   added: (at-robby room3)
   goals met: 8 of 37
4. (drop ball8 room3 right)
   deleted: (carry ball8 right)
   added: (at ball8 room3) (free right)
   goals met: 9 of 37
5. (drop ball9 room3 left)
   deleted: (carry ball9 left)
   added: (at ball9 room3) (free left)
   goals met: 10 of 37
6. (move room3 roomb)
   deleted: (at-robby room3)
   added: (at-robby roomb)
   goals met: 10 of 37
7. (pick ball20 roomb left)
   deleted: (at ball20 roomb) (free left)
   added: (carry ball20 left)
   goals met: 10 of 37
8. (pick ball19 roomb right)
   deleted: (at ball19 roomb) (free right)
   added: (carry ball19 right)
   goals met: 10 of 37
9. (move roomb room3)
   deleted: (at-robby roomb)
   added: (at-robby room3)
   goals met: 10 of 37
10. (drop ball19 room3 right)
   deleted: (carry ball19 right)
   added: (at ball19 room3) (free right)
   goals met: 11 of 37
11. (drop ball20 room3 left)
   deleted: (carry ball20 left)
   added: (at ball20 room3) (free left)
   goals met: 12 of 37
12. (move room3 roomb)
   deleted: (at-robby room3)
   added: (at-robby roomb)
   goals met: 12 of 37
13. (pick ball18 roomb left)
   deleted: (at ball18 roomb) (free left)
   added: (carry ball18 left)
   goals met: 12 of 37
14. (pick ball17 roomb right)
   deleted: (at ball17 roomb) (free right)
   added: (carry ball17 right)
   goals met: 12 of 37
15. (move roomb room3)
   deleted: (at-robby roomb)
   added: (at-robby room3)
   goals met: 12 of 37
16. (drop ball17 room3 right)
   deleted: (carry ball17 right)
   added: (at ball17 room3) (free right)
   goals met: 13 of 37
17. (drop ball18 room3 left)
   deleted: (carry ball18 left)
   added: (at ball18 room3) (free left)
   goals met: 14 of 37
18. (move room3 roomb)
   deleted: (at-robby room3)
   added: (at-robby roomb)
   goals met: 14 of 37
19. (pick ball16 roomb left)
   deleted: (at ball16 roomb) (free left)
   added: (carry ball16 left)
   goals met: 14 of 37
20. (pick ball15 roomb right)
   deleted: (at ball15 roomb) (free right)
   added: (carry ball15 right)
   goals met: 14 of 37
21. (move roomb room3)
   deleted: (at-robby roomb)
   added: (at-robby room3)
   goals met: 14 of 37
22. (drop ball15 room3 right)
   deleted: (carry ball15 right)
   added: (at ball15 room3) (free right)
   goals met: 15 of 37
23. (drop ball16 room3 left)
   deleted: (carry ball16 left)
   added: (at ball16 room3) (free left)
   goals met: 16 of 37
24. (move room3 roomb)
   deleted: (at-robby room3)
   added: (at-robby roomb)
   goals met: 16 of 37
25. (pick ball14 roomb left)
   deleted: (at ball14 roomb) (free left)
   added: (carry ball14 left)
   goals met: 16 of 37
26. (pick ball13 roomb right)
   deleted: (at ball13 roomb) (free right)
   added: (carry ball13 right)
   goals met: 16 of 37
27. (move roomb room3)
   deleted: (at-robby roomb)
   added: (at-robby room3)
   goals met: 16 of 37
28. (drop ball13 room3 right)
   deleted: (carry ball13 right)
   added: (at ball13 room3) (free right)
   goals met: 17 of 37
29. (drop ball14 room3 left)
   deleted: (carry ball14 left)
   added: (at ball14 room3) (free left)
   goals met: 18 of 37
30. (move room3 roomb)
   deleted: (at-robby room3)
   added: (at-robby roomb)
   goals met: 18 of 37
31. (pick ball12 roomb left)
   deleted: (at ball12 roomb) (free left)
   added: (carry ball12 left)
   goals met: 18 of 37
32. (pick ball11 roomb right)
   deleted: (at ball11 roomb) (free right)
   added: (carry ball11 right)
   goals met: 18 of 37
33. (move roomb room3)
   deleted: (at-robby roomb)
   added: (at-robby room3)
   goals met: 18 of 37
34. (drop ball11 room3 right)
   deleted: (carry ball11 right)
   added: (at ball11 room3) (free right)
   goals met: 19 of 37
35. (drop ball12 room3 left)
   deleted: (carry ball12 left)
   added: (at ball12 room3) (free left)
   goals met: 20 of 37
36. (move room3 roomb)
   deleted: (at-robby room3)
   added: (at-robby roomb)
   goals met: 20 of 37
37. (pick ball10 roomb left)
   deleted: (at ball10 roomb) (free left)
   added: (carry ball10 left)
   goals met: 20 of 37
38. (move roomb room5)
   deleted: (at-robby roomb)
   added: (at-robby room5)
   goals met: 20 of 37
39. (pick ball37 room5 right)
   deleted: (at ball37 room5) (free right)
   added: (carry ball37 right)
   goals met: 20 of 37
40. (move room5 room3)
   deleted: (at-robby room5)
   added: (at-robby room3)
   goals met: 20 of 37
41. (drop ball37 room3 right)
   deleted: (carry ball37 right)
   added: (at ball37 room3) (free right)
   goals met: 21 of 37
42. (drop ball10 room3 left)
   deleted: (carry ball10 left)
   added: (at ball10 room3) (free left)
   goals met: 22 of 37
43. (move room3 room5)
   deleted: (at-robby room3)
   added: (at-robby room5)
   goals met: 22 of 37
44. (pick ball36 room5 left)
   deleted: (at ball36 room5) (free left)
   added: (carry ball36 left)
   goals met: 22 of 37
45. (pick ball35 room5 right)
   deleted: (at ball35 room5) (free right)
   added: (carry ball35 right)
   goals met: 22 of 37
46. (move room5 room3)
   deleted: (at-robby room5)
   added: (at-robby room3)
   goals met: 22 of 37
47. (drop ball35 room3 right)
   deleted: (carry ball35 right)
   added: (at ball35 room3) (free right)
   goals met: 23 of 37
48. (drop ball36 room3 left)
   deleted: (carry ball36 left)
   added: (at ball36 room3) (free left)
   goals met: 24 of 37
49. (move room3 room5)
   deleted: (at-robby room3)
   added: (at-robby room5)
   goals met: 24 of 37
50. (pick ball34 room5 left)
   deleted: (at ball34 room5) (free left)
   added: (carry ball34 left)
   goals met: 24 of 37
51. (pick ball33 room5 right)
   deleted: (at ball33 room5) (free right)
   added: (carry ball33 right)
   goals met: 24 of 37
52. (move room5 room3)
   deleted: (at-robby room5)
   added: (at-robby room3)
   goals met: 24 of 37
53. (drop ball33 room3 right)
   deleted: (carry ball33 right)
   added: (at ball33 room3) (free right)
   goals met: 25 of 37
54. (drop ball34 room3 left)
   deleted: (carry ball34 left)
   added: (at ball34 room3) (free left)
   goals met: 26 of 37
55. (move room3 room5)
   deleted: (at-robby room3)
   added: (at-robby room5)
   goals met: 26 of 37
56. (pick ball32 room5 left)
   deleted: (at ball32 room5) (free left)
   added: (carry ball32 left)
   goals met: 26 of 37
57. (move room5 room4)
   deleted: (at-robby room5)
   added: (at-robby room4)
   goals met: 26 of 37
58. (pick ball31 room4 right)
   deleted: (at ball31 room4) (free right)
   added: (carry ball31 right)
   goals met: 26 of 37
59. (move room4 room3)
   deleted: (at-robby room4)
   added: (at-robby room3)
   goals met: 26 of 37
60. (drop ball31 room3 right)
   deleted: (carry ball31 right)
   added: (at ball31 room3) (free right)
   goals met: 27 of 37
61. (drop ball32 room3 left)
   deleted: (carry ball32 left)
   added: (at ball32 room3) (free left)
   goals met: 28 of 37
62. (move room3 room4)
   deleted: (at-robby room3)
   added: (at-robby room4)
   goals met: 28 of 37
63. (pick ball30 room4 left)
   deleted: (at ball30 room4) (free left)
   added: (carry ball30 left)
   goals met: 28 of 37
64. (pick ball29 room4 right)
   deleted: (at ball29 room4) (free right)
   added: (carry ball29 right)
   goals met: 28 of 37
65. (move room4 room3)
   deleted: (at-robby room4)
   added: (at-robby room3)
   goals met: 28 of 37
66. (drop ball29 room3 right)
   deleted: (carry ball29 right)
   added: (at ball29 room3) (free right)
   goals met: 29 of 37
67. (drop ball30 room3 left)
   deleted: (carry ball30 left)
   added: (at ball30 room3) (free left)
   goals met: 30 of 37
68. (move room3 rooma)
   deleted: (at-robby room3)
   added: (at-robby rooma)
   goals met: 30 of 37
69. (pick ball7 rooma left)
   deleted: (at ball7 rooma) (free left)
   added: (carry ball7 left)
   goals met: 30 of 37
70. (pick ball6 rooma right)
   deleted: (at ball6 rooma) (free right)
   added: (carry ball6 right)
   goals met: 30 of 37
71. (move rooma room3)
   deleted: (at-robby rooma)
   added: (at-robby room3)
   goals met: 30 of 37
72. (drop ball6 room3 right)
   deleted: (carry ball6 right)
   added: (at ball6 room3) (free right)
   goals met: 31 of 37
73. (drop ball7 room3 left)
   deleted: (carry ball7 left)
   added: (at ball7 room3) (free left)
   goals met: 32 of 37
74. (move room3 rooma)
   deleted: (at-robby room3)
   added: (at-robby rooma)
   goals met: 32 of 37
75. (pick ball5 rooma left)
   deleted: (at ball5 rooma) (free left)
   added: (carry ball5 left)
   goals met: 32 of 37
76. (pick ball4 rooma right)
   deleted: (at ball4 rooma) (free right)
   added: (carry ball4 right)
   goals met: 32 of 37
77. (move rooma room3)
   deleted: (at-robby rooma)
   added: (at-robby room3)
   goals met: 32 of 37
78. (drop ball4 room3 right)
   deleted: (carry ball4 right)
   added: (at ball4 room3) (free right)
   goals met: 33 of 37
79. (drop ball5 room3 left)
   deleted: (carry ball5 left)
   added: (at ball5 room3) (free left)
   goals met: 34 of 37
80. (move room3 rooma)
   deleted: (at-robby room3)
   added: (at-robby rooma)
   goals met: 34 of 37
81. (pick ball3 rooma left)
   deleted: (at ball3 rooma) (free left)
   added: (carry ball3 left)
   goals met: 34 of 37
82. (pick ball2 rooma right)
   deleted: (at ball2 rooma) (free right)
   added: (carry ball2 right)
   goals met: 34 of 37
83. (move rooma room3)
   deleted: (at-robby rooma)
   added: (at-robby room3)
   goals met: 34 of 37
84. (drop ball2 room3 right)
   deleted: (carry ball2 right)
   added: (at ball2 room3) (free right)
   goals met: 35 of 37
85. (drop ball3 room3 left)
   deleted: (carry ball3 left)
   added: (at ball3 room3) (free left)
   goals met: 36 of 37
86. (move room3 rooma)
   deleted: (at-robby room3)
   added: (at-robby rooma)
   goals met: 36 of 37
87. (pick ball1 rooma left)
   deleted: (at ball1 rooma) (free left)
   added: (carry ball1 left)
   goals met: 36 of 37
88. (move rooma room3)
   deleted: (at-robby rooma)
   added: (at-robby room3)
   goals met: 36 of 37
89. (drop ball1 room3 left)
   deleted: (carry ball1 left)
   added: (at ball1 room3) (free left)
   goals met: 37 of 37
